app/models/house.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."house_id" = $1 LIMIT $2  [["house_id", 1], ["LIMIT", 1]]
---
  def address
    Address.find_by(house_id: id)